* >Natural Source Header 000000
* :Mode S
* :CP
* <Natural Source Header
* THIS PROGRAM SHOWS SOME INTERESTING
* QUIRKS OF PERIODS.
*
DEFINE DATA LOCAL
1 #NUMBER (N3) INIT <123>
END-DEFINE
*
INCLUDE AATITLER
INCLUDE AASETC
*
WRITE 5T 'DATA FOR THIS PROGRAM' /
5T '??????????' /
5T '#NUMBER IS: ' #NUMBER
*
WRITE // 5T '#NUMBER WITH EM="."999'
/ 5T 'STARTS HERE==>' #NUMBER (EM='.'999)
// 5T '#NUMBER WITH EM=.999'
/ 5T 'STARTS HERE==>' #NUMBER (EM=.999)
*
END
