* >Natural Source Header 000000
* :Mode S
* :CP
* <Natural Source Header
DEFINE DATA LOCAL
1 #SALES (N8/1:12) INIT
  <12345,23456,34567,45678,56789,67890,
  12345,23456,34567,45678,56789,67890>
1 #AVERAGE (N8.2)
1 #ARRAY-SIZE (I2) INIT <12>
END-DEFINE
*
INCLUDE AATITLER
INCLUDE AASETC
*
CALLNAT 'NOTAT03D' #SALES (1:12) #AVERAGE #ARRAY-SIZE
*
WRITE 5T 'AVERAGE SALES: ' #AVERAGE
*
END

