PROGRAM 1

DEFINE DATA LOCAL
1 #ALPHA (A10)     INIT <'04/13/2015'>
1 #DATE (D)
1 #FORMAT (A1)
END-DEFINE
REPEAT
  INPUT #ALPHA (AD=MD)
  DECIDE FOR FIRST CONDITION
    WHEN #ALPHA = MASK (MM'/'DD'/'YYYY)
         ASSIGN #FORMAT = 'U'
         MOVE EDITED #ALPHA TO #DATE (EM=MM/DD/YYYY)
    WHEN #ALPHA = MASK (DD'-'MM'-'YYYY)
         ASSIGN #FORMAT = 'E'
         MOVE EDITED #ALPHA TO #DATE (EM=DD-MM-YYYY)
    WHEN #ALPHA = MASK (YYYY/MM/DD)
         ASSIGN #FORMAT = 'I'
         MOVE EDITED #ALPHA TO #DATE (EM=YYYY/MM/DD)
    WHEN NONE
         REINPUT 'invalid format'
  END-DECIDE
  DISPLAY #ALPHA
          #FORMAT
          #DATE
          #DATE (EM=MM/DD/YYYY)
END-REPEAT
END


PROGRAM 2

DEFINE DATA LOCAL
1 #ALPHA (A15)     INIT <'04/13/2015'> /* DTFORM = U
1 #DATE (D)
END-DEFINE
REPEAT
  INPUT #ALPHA (AD=MD)
  IF  #ALPHA IS (D)
    THEN
      ASSIGN #DATE = VAL (#ALPHA)
      DISPLAY #ALPHA 
              #DATE
              #DATE (EM=YYYY-MM-DD)
    ELSE
      REINPUT 'invalid format or value'
  END-IF
END-REPEAT
END 