0010DEFINE DATA LOCAL
00201 #MR (I4)     CONST <2>
00301 #MC (I4)     CONST <4>
00401 #N (I4/#MR, #MC) INIT (1, V) <1, 2, 3, 4>
0050                        (2, V) <5, 6, 7, 8>
00601 #TOTAL (I4)
00701 #SUM (I4)
00801 #I (I4)
00901 #J (I4)
0100END-DEFINE
0110FOR #I = 1 #MR
0120  FOR #J = 1 #MC
0130    ADD #N (#I, #J) TO #TOTAL
0140  END-FOR
0150END-FOR
0160WRITE '=' #TOTAL /
0170**
0180#SUM := #N (*, *) + 0
0190WRITE '=' #SUM
0200END
