0010DEFINE DATA LOCAL
00201 #M (I4)     CONST <2>
00301 #CSV
0040  2 #ID (A8)
0050  2 #NAME (A20)
0060  2 #CURR (A3/#M)
0070  2 #SAL (P9/#M)
0080  2 #LEAVE (N2)
00901 #HDR (A20/5)
0100END-DEFINE
0110DEFINE WORK FILE 1 'c:\Users\Ralph\Desktop\csv-test.csv'
0120            TYPE "CSV"
0130*
0140READ WORK 1 ONCE #HDR (*)
0150READ WORK 1 #CSV
0160  DISPLAY #CSV
0170END-WORK
0180END
