0010DEFINE DATA LOCAL
00201 #ALPHA (A15)     INIT <'04/13/2015'> /* DTFORM = U
00301 #DATE (D)
0040END-DEFINE
0050REPEAT
0060  INPUT #ALPHA (AD=MD)
0070  IF  #ALPHA IS (D)
0080    THEN
0090      ASSIGN #DATE = VAL (#ALPHA)
0100      DISPLAY #ALPHA
0110              #DATE
0120              #DATE (EM=YYYY-MM-DD)
0130    ELSE
0140      REINPUT 'invalid format or value'
0150  END-IF
0160END-REPEAT
0170END
