0010DEFINE DATA LOCAL
00201 #FROM (D)  INIT <D'04/06/2015'>
00301 #TO (D)    INIT <D'04/09/2015'>
00401 #DAYS (N3)
0050END-DEFINE
0060#DAYS := D'04/09/2015' - D'04/06/2015'
0070WRITE #DAYS 'days between D"04/09/2015" and D"04/06/2015"'
0080*
0090#DAYS := #TO - #FROM
0100WRITE #DAYS 'days between #FROM and #TO'
0110*
0120#DAYS := *DATX - D'04/06/2015'
0130WRITE #DAYS 'days between *DATX and D"04/06/2015"'
0140END
