0010DEFINE DATA LOCAL
00201 VEH VIEW VEHICLES
0030  2 YEAR
0040  2 MAKE
0050END-DEFINE
0060LIMIT 54
0070READ VEH BY MODEL-YEAR-MAKE
0080  AT BREAK OF MAKE
0090    DISPLAY
0100         OLD (YEAR)
0110         OLD (MAKE)
0120         COUNT (MAKE)
0130  END-BREAK
0140END-READ
0150END
