DEFINE DATA LOCAL
1 VEH VIEW VEHICLES
  2 YEAR
  2 MAKE
END-DEFINE
LIMIT 54
READ VEH BY MODEL-YEAR-MAKE
  AT BREAK OF MAKE
    DISPLAY
            OLD (YEAR)
            OLD (MAKE)
            COUNT (MAKE)
  END-BREAK
END-READ
END