0010DEFINE DATA LOCAL
00201 VEH VIEW VEHICLES
0030  2 MODEL-YEAR-MAKE
0040END-DEFINE
0050LIMIT 7
0060HISTOGRAM VEH FOR MODEL-YEAR-MAKE
0070  DISPLAY
0080          MODEL-YEAR-MAKE (EM=XXXX-X(20))
0090          *NUMBER
0100END-HISTOGRAM
0110END
