DEFINE DATA LOCAL
1 VEH VIEW VEHICLES
  2 MODEL-YEAR-MAKE       2 REDEFINE MODEL-YEAR-MAKE
    3 #YEAR (N4) (HD='Year')
 3 #MAKE (A20) (HD='Make')
END-DEFINE
LIMIT 7
HISTOGRAM VEH FOR MODEL-YEAR-MAKE
  DISPLAY
          #YEAR
          #MAKE
          *NUMBER
END-HISTOGRAM
END