0010DEFINE DATA LOCAL
00201 VEH VIEW VEHICLES
0030  2 MODEL-YEAR-MAKE       2 REDEFINE MODEL-YEAR-MAKE
0040    3 #YEAR (N4) (HD='Year')
0050 3 #MAKE (A20) (HD='Make')
0060END-DEFINE
0070LIMIT 7
0080HISTOGRAM VEH FOR MODEL-YEAR-MAKE
0090  DISPLAY
0100          #YEAR
0110          #MAKE
0120          *NUMBER
0130END-HISTOGRAM
0140END
