DEFINE DATA LOCAL
1 TUR    VIEW SAG-TOURS
  2 CONTRACT-TYPE
  2 CONTRACT-ID
END-DEFINE
R.
READ TUR BY CONTRACT-TYPE-SP FROM "B" - H'000000000000'
                               TO "B" - H'FF'
  DISPLAY CONTRACT-TYPE
          CONTRACT-ID
END-READ
WRITE / 'End:' CONTRACT-TYPE *COUNTER (R.)
END