DEFINE DATA LOCAL
1 TUR    VIEW SAG-TOURS
  2 CONTRACT-TYPE
  2 CONTRACT-ID
END-DEFINE
R.
READ TUR BY CONTRACT-TYPE-SP FROM "B"
  IF  CONTRACT-TYPE > "B"
    THEN
      ESCAPE BOTTOM
  END-IF
  DISPLAY CONTRACT-TYPE
          CONTRACT-ID
END-READ
WRITE / 'End:' CONTRACT-TYPE *COUNTER (R.)
END