0010DEFINE DATA LOCAL
00201 TUR    VIEW SAG-TOURS
0030  2 CONTRACT-TYPE
0040  2 CONTRACT-ID
0050END-DEFINE
0060R.
0070READ TUR BY CONTRACT-TYPE-SP FROM "B"
0080  IF  CONTRACT-TYPE > "B"
0090    THEN
0100      ESCAPE BOTTOM
0110  END-IF
0120  DISPLAY CONTRACT-TYPE
0130          CONTRACT-ID
0140END-READ
0150WRITE / 'End:' CONTRACT-TYPE *COUNTER (R.)
0160END
