0010DEFINE DATA LOCAL
00201 TUR    VIEW SAG-TOURS
0030  2 CONTRACT-TYPE
0040  2 CONTRACT-ID
0050END-DEFINE
0060R.
0070READ TUR BY CONTRACT-TYPE-SP FROM "B" - H'000000000000'
0080                               TO "B" - H'FF'
0090  DISPLAY CONTRACT-TYPE
0100          CONTRACT-ID
0110END-READ
0120WRITE / 'End:' CONTRACT-TYPE *COUNTER (R.)
0130END
