DEFINE DATA LOCAL
1 EMP    VIEW EMPLOYEES
  2 DEPT
  2 NAME
1 #DEPT-PERSON (A26)    1 REDEFINE #DEPT-PERSON
  2 #DEPT (A6)          /* INIT <"ADMA01">
  2 #PERSON (A20)       /* INIT <"MADSen">
END-DEFINE
ASSIGN #DEPT   = "ADMA01"
ASSIGN #PERSON = "MADSEN"
FIND EMP WITH DEPT-PERSON = #DEPT-PERSON
  DISPLAY DEPT
          NAME
END-FIND
END