DEFINE DATA LOCAL
1 EMP    VIEW EMPLOYEES
  2 DEPT
  2 NAME
1 #DEPT-PERSON (A26)    INIT <"ADMA01MADSEN">
END-DEFINE
FIND EMP WITH DEPT-PERSON = #DEPT-PERSON
  DISPLAY DEPT
          NAME
END-FIND
END