0010DEFINE DATA LOCAL
00201 EMP    VIEW EMPLOYEES
0030  2 DEPT
0040  2 NAME
00501 #DP-DEF                                   /* Define a structure
0060  2 #DEPT (A6)     INIT <"ADMA01">
0070  2 #PERSON (A20)  INIT <"MADSEN">
0080                        1 REDEFINE #DP-DEF  /* Define the block
0090  2 #DEPT-PERSON (A26)
0100END-DEFINE
0110FIND EMP WITH DEPT-PERSON = #DEPT-PERSON
0120  DISPLAY DEPT
0130          NAME
0140END-FIND
0150END
