0010DEFINE DATA LOCAL
00201 EMP    VIEW EMPLOYEES
0030  2 DEPT
0040  2 NAME
00501 #DEPT-PERSON (A26)    1 REDEFINE #DEPT-PERSON
0060  2 #DEPT (A6)          /* INIT <"ADMA01">
0070  2 #PERSON (A20)       /* INIT <"MADSen">
0080END-DEFINE
0090ASSIGN #DEPT   = "ADMA01"
0100ASSIGN #PERSON = "MADSEN"
0110FIND EMP WITH DEPT-PERSON = #DEPT-PERSON
0120  DISPLAY DEPT
0130          NAME
0140END-FIND
0150END
