0010DEFINE DATA LOCAL
00201 EMP    VIEW EMPLOYEES
0030  2 DEPT
0040  2 NAME
00501 #DEPT-PERSON (A26)    INIT <"ADMA01MADSEN">
0060END-DEFINE
0070FIND EMP WITH DEPT-PERSON = #DEPT-PERSON
0080  DISPLAY DEPT
0090          NAME
0100END-FIND
0110END
