0010DEFINE DATA LOCAL
00201 #PDT (T)  INIT <*TIMX> (HD='Pacific Time')
00301 #NDT (T)               (HD='Newfoundland Time')
0040END-DEFINE
0050COMPUTE #NDT = #PDT + T'03:30:00'     /* 3.5 hours
0060DISPLAY #PDT (EM=YYYY/MM/DD^HH:II:SS)
0070        #NDT (EM=YYYY/MM/DD^HH:II:SS)
0080END
