                                                        
DEFINE DATA PARAMETER
1 #XHTML  (A) DYNAMIC
1 #NODE2  HANDLE OF OBJECT BY VALUE
1 #LASTIMG (I4)

LOCAL
1 #IMG (I4)
1 #NODE1 HANDLE OF OBJECT
1 #DYN (A) DYNAMIC
END-DEFINE
DEFINE SUBROUTINE NEXT_NODE
REPEAT
  SEND "TEXT" TO #NODE2 RETURN #DYN
  SEND "IMAGE" TO #NODE2 RETURN #IMG
  /*
  IF #LASTIMG = 1 AND #IMG NE 3
    COMPRESS #XHTML ">" INTO #XHTML LEAVING NO
  ELSE
    IF #LASTIMG = 7
      IF  #IMG = 8
        COMPRESS #XHTML "/>" INTO #XHTML LEAVING NO
      ELSE IF #IMG NE 3
          COMPRESS #XHTML ">" INTO #XHTML LEAVING NO
        END-IF
      END-IF
    END-IF
  END-IF
  /*
  DECIDE ON FIRST #IMG
    VALUE  1
      COMPRESS #XHTML "<" #DYN  INTO #XHTML LEAVING NO
    VALUE  3
      COMPRESS #XHTML #DYN INTO #XHTML
    VALUE  4
      COMPRESS #XHTML "<!--" #DYN "-->" INTO #XHTML LEAVING NO
    VALUE  6
      COMPRESS #XHTML "<![" "CDATA[" #DYN "]]" ">" INTO #XHTML LEAVING NO
    VALUE  5
      COMPRESS #XHTML "<?" #DYN ">" INTO #XHTML LEAVING NO
    VALUE  7
      COMPRESS #XHTML "='" #DYN "'" INTO #XHTML LEAVING NO
    VALUE  8
      COMPRESS #XHTML "</" #DYN ">" INTO #XHTML LEAVING NO
    NONE
      COMPRESS #XHTML #DYN INTO #XHTML LEAVING NO
  END-DECIDE
  /*
  #LASTIMG := #IMG
  SEND "CHILD" TO #NODE2 RETURN #NODE1
  IF #NODE1 NE NULL-HANDLE
    PERFORM NEXT_NODE #XHTML #NODE1 #LASTIMG
  END-IF

  SEND "NEXT" TO #NODE2 RETURN #NODE1
*  PRINT #NODE1
  IF #NODE1 = NULL-HANDLE
    ESCAPE BOTTOM
  ELSE
    #NODE2 := #NODE1
  END-IF
END-REPEAT
END-SUBROUTINE
END