                                                        

DEFINE DATA LOCAL
1 FIELD#1 (A40)
1 #ARRAY (A30/1:20)
1 #OUT (A50)
END-DEFINE
INCLUDE AASETCR

FIELD#1 := 'ATTN: TOM GROSS 3601 S 48 ST '
SEPARATE FIELD#1 INTO #ARRAY (*)
WITH RETAINED DELIMITERS '0123456789'
COMPRESS #ARRAY (2:20) INTO #OUT LEAVING
NO SPACE
WRITE #OUT
END

Page 1 07-06-11 06:50:16

3601 S48 ST             