/* OPTIONS MCG=(ON) /* use NOC if possible
DEFINE FUNCTION FASEARCH
  RETURNS RESULT (I4)
  DEFINE DATA
  PARAMETER
    1 #P_STRING   (A) DYNAMIC BY VALUE
    1 #P_SEARCH   (A) DYNAMIC BY VALUE
  LOCAL
    1 #I  (I4)
    1 #J  (I4)
    1 #A1 (A1)
  END-DEFINE
*
RESULT := 0
F1. FOR #I := 1 TO *LENGTH(#P_STRING)
    #A1 := SUBSTR(#P_STRING, #I, 1)
    EXAMINE FULL #P_SEARCH FOR FULL #A1 GIVING POSITION IN #J
    IF #J <> 0 THEN
      RESULT := #I
      ESCAPE BOTTOM (F1.)
    END-IF
  END-FOR /* (F1.)
END-FUNCTION
END
