/* OPTIONS MCG=(ON) /* use NOC if possible
DEFINE FUNCTION FUVERIFY
  RETURNS RESULT (I4)
  DEFINE DATA
  PARAMETER
    1 #P_STRING   (U) DYNAMIC BY VALUE
    1 #P_VERIFY   (U) DYNAMIC BY VALUE
  LOCAL
    1 #I  (I4)
    1 #J  (I4)
    1 #U1 (U1)
  END-DEFINE
*
RESULT := 0
F1. FOR #I := 1 TO *LENGTH(#P_STRING)
    #U1 := SUBSTR(#P_STRING, #I, 1)
    EXAMINE FULL #P_VERIFY FOR FULL #U1 GIVING POSITION IN #J
    IF #J = 0 THEN
      RESULT := #I
      ESCAPE BOTTOM (F1.)
    END-IF
  END-FOR /* (F1.)
END-FUNCTION
END
