* >Natural Source Header 000000
* :Mode S
* :CP
* <Natural Source Header
DEFINE DATA PARAMETER
1 #SALES (N8/1:V)
1 #AVERAGE (N8.2)
LOCAL
1 #LOOP (I4)
1 #SUM (N12)
1 #CPU-START (I4)
1 #CPU-ELAPSED (I4)
END-DEFINE
*
SETA. SETTIME
MOVE *CPU-TIME TO #CPU-START
FOR #LOOP = 1 TO *OCC (#SALES)
ADD #SALES (#LOOP) TO #SUM
END-FOR
*
COMPUTE #AVERAGE = #SUM / #ARRAY-SIZE
*
END
