* >Natural Source Header 000000
* :Mode S
* :CP
* <Natural Source Header
DEFINE DATA PARAMETER
1 #SALES (A10)
LOCAL
1 #START (I2) INIT <9>
1 #CHAR (I2) INIT <3>
END-DEFINE
*
MOVE '***' TO SUBSTRING (#SALES,#START,#CHAR)
*
END
